var number = +prompt('Input your number in group', '');
var array_of_autors = [
    'Сенека',
    'Овідій',
    'Д.Байрон',
    'Г.Сковорода',
    'Д.Лихачев',
    'Горацій',
    'Цицерон',
    'М.Шумило',
    'Ч.Айтматов',
    'П.Гольбах',
    'Т.Шевченко',
    'Д.Павличко',
    'Л.Костенко',
    'Т.Шевченко',
    'П.Чубинський',
    'Л.Толстой',
    'В.Голобородько',
    'М.Гоголь',
    'Е.Челебі',
    'О.Пахльовська',
    'І.Репін',
    'Олександр Олесь',
    'Л.Толстой',
    'А.Міцкевич',
    'О.Довженко',
    'П.Тичина',
    'А.Франс',
    'Старий Заповіт',
    'Володимир Мономах',
    'Г.Сковорода',
    'Т.Шевченко'
];
var array_of_phrases = [
    'Люблять батьківщину не за те, що вона велика, а за те, що своя',
    'І дим батьківщини солодкий.',
    'Той, хто не любить своєї країни, нічого любити не може',
    'Кожному мила своя сторона.',
    'Усвідомлена любов до свого народу не поєднується з ненавистю до інших.',
    'Ті, що виїздять за море, міняють небо, а не душу.',
    'Для нас дорогі батьки, дорогі діти, близькі, родичі; але всі уявлення про любов до чого-небудь поєднані в одному слові «вітчизна».',
    'Мова — це глибина тисячоліть',
    'Той, хто в біді кидає свій народ, стає його ворогом',
    'Де немає свободи, там немає і вітчизни.',
    'В своїй хаті своя й правда, І сила, і воля.',
    'Вітчизна — ось і альфа, і омега!',
    'Нації вмирають не від інфаркту. Спочатку їм відбирає мову.',
    'Нема на світі України, немає другого Дніпра',
    'Ще не вмерла України і слава, і воля.',
    'Я дуже люблю народну українсь-ку мову, звучну, барвисту й таку м`я-ку',
    'Мова вмирає, коли наступне покоління втрачає розуміння значення слів.',
    'М. Гоголь Дивуєшся дорогоцінності мови нашої: в ній що не звук, то подарунок, все крупно, зернисто, як самі перла.',
    'Українці — стародавній народ, а мова "їхня мова багатша і всеосяжніша, ніж персидська, китайська, монгольська і всілякі інші.',
    'Раби — це нація, котра не має Слова. Тому й не зможе захистить себе.',
    'Відчуваю й усвідомлюю, яка це красива й легка українськa мова.',
    'Для всіх ти мертва і смішна, Для всіх ти бідна і нещасна, Моя Україно пре-красна, Пісень і волі сторона.',
    'Слово є вчинок',
    'Народна пісня-духовне обличчя нації',
    'Українська пісня — це бездонна душа українськогo народу, це його слава.',
    'Я єсть народ, якого Правди сила ніким звойована ще не була.',
    'Немає магії сильнішої, ніж магія слів.',
    'Споконвіку було Слово.',
    'Коли щось умієте, того не забувайте, а чого не вмієте — то того учітесь...',
    'Безперервно думай, щоб пізнати себе',
    'Борітеся — поборете!'
];
var btn1 = document.getElementById(1);
var btn2 = document.getElementById(2);
var btn3 = document.getElementById(3);
var btn4 = document.getElementById(4);
var btn5 = document.getElementById(5);
var h1 = document.querySelector('h1');

btn1.innerHTML = array_of_autors[number-1];
btn2.innerHTML = array_of_autors[number];
btn3.innerHTML = array_of_autors[number+1];
btn4.innerHTML = array_of_autors[number+2];
btn5.innerHTML = array_of_autors[number+3];

btn1.onclick = function() {
    h1.innerHTML = array_of_phrases[number-1];
    alert('Виcловлювання автора ' + array_of_autors[number-1]);
}

btn2.onclick = function() {
    h1.innerHTML = array_of_phrases[number];
    alert('Виcловлювання автора ' + array_of_autors[number]);
}

btn3.onclick = function() {
    h1.innerHTML = array_of_phrases[number+1];
    alert('Виcловлювання автора ' + array_of_autors[number+1]);
}

btn4.onclick = function() {
    h1.innerHTML = array_of_phrases[number+2];
    alert('Виcловлювання автора ' + array_of_autors[number+2]);
}

btn5.onclick = function() {
    h1.innerHTML = array_of_phrases[number+3];
    alert('Виcловлювання автора ' + array_of_autors[number+3]);
}